joshuawboone/barkitup/zettalights/bootloader/Arduino IDE/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug

# -----------------------------------
# Adafruit Feather M0 (SAMD21)
# -----------------------------------
adafruit_feather_m0.name=Adafruit Feather M0 (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_feather_m0.vid.0=0x239A
adafruit_feather_m0.pid.0=0x800B
adafruit_feather_m0.vid.1=0x239A
adafruit_feather_m0.pid.1=0x000B
adafruit_feather_m0.vid.2=0x239A
adafruit_feather_m0.pid.2=0x0015

# Upload
adafruit_feather_m0.upload.tool=bossac18
adafruit_feather_m0.upload.protocol=sam-ba
adafruit_feather_m0.upload.maximum_size=262144
adafruit_feather_m0.upload.offset=0x2000
adafruit_feather_m0.upload.use_1200bps_touch=true
adafruit_feather_m0.upload.wait_for_upload_port=true
adafruit_feather_m0.upload.native_usb=true

# Build
adafruit_feather_m0.build.mcu=cortex-m0plus
adafruit_feather_m0.build.f_cpu=48000000L
adafruit_feather_m0.build.usb_product="Feather M0"
adafruit_feather_m0.build.usb_manufacturer="Adafruit"
adafruit_feather_m0.build.board=SAMD_ZERO
adafruit_feather_m0.build.core=arduino
adafruit_feather_m0.build.extra_flags=-D__SAMD21G18A__ -DADAFRUIT_FEATHER_M0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_feather_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m0.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_feather_m0.build.variant=feather_m0
adafruit_feather_m0.build.variant_system_lib=
adafruit_feather_m0.build.vid=0x239A
adafruit_feather_m0.build.pid=0x800B
adafruit_feather_m0.bootloader.tool=openocd
adafruit_feather_m0.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_feather_m0.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m0.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m0.menu.opt.fast=Fast (-O2)
adafruit_feather_m0.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m0.menu.opt.faster=Faster (-O3)
adafruit_feather_m0.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m0.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m0.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
adafruit_feather_m0.menu.usbstack.arduino=Arduino
adafruit_feather_m0.menu.usbstack.tinyusb=TinyUSB
adafruit_feather_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_feather_m0.menu.debug.off=Off
adafruit_feather_m0.menu.debug.on=On
adafruit_feather_m0.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Feather M0 Express (SAMD21)
# -----------------------------------
adafruit_feather_m0_express.name=Adafruit Feather M0 Express (SAMD21)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_feather_m0_express.vid.0=0x239A
adafruit_feather_m0_express.pid.0=0x801B
adafruit_feather_m0_express.vid.1=0x239A
adafruit_feather_m0_express.pid.1=0x001B

# Upload
adafruit_feather_m0_express.upload.tool=bossac18
adafruit_feather_m0_express.upload.protocol=sam-ba
adafruit_feather_m0_express.upload.maximum_size=262144
adafruit_feather_m0_express.upload.offset=0x2000
adafruit_feather_m0_express.upload.use_1200bps_touch=true
adafruit_feather_m0_express.upload.wait_for_upload_port=true
adafruit_feather_m0_express.upload.native_usb=true

# Build
adafruit_feather_m0_express.build.mcu=cortex-m0plus
adafruit_feather_m0_express.build.f_cpu=48000000L
adafruit_feather_m0_express.build.usb_product="Feather M0 Express"
adafruit_feather_m0_express.build.usb_manufacturer="Adafruit"
adafruit_feather_m0_express.build.board=SAMD_FEATHER_M0_EXPRESS
adafruit_feather_m0_express.build.core=arduino
adafruit_feather_m0_express.build.extra_flags=-D__SAMD21G18A__ -DARDUINO_SAMD_FEATHER_M0 -DADAFRUIT_FEATHER_M0_EXPRESS -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
adafruit_feather_m0_express.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m0_express.build.openocdscript=scripts/openocd/daplink_samd21.cfg
adafruit_feather_m0_express.build.variant=feather_m0_express
adafruit_feather_m0_express.build.variant_system_lib=
adafruit_feather_m0_express.build.vid=0x239A
adafruit_feather_m0_express.build.pid=0x801B
adafruit_feather_m0_express.bootloader.tool=openocd
adafruit_feather_m0_express.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

# Menu: Optimization
adafruit_feather_m0_express.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m0_express.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m0_express.menu.opt.fast=Fast (-O2)
adafruit_feather_m0_express.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m0_express.menu.opt.faster=Faster (-O3)
adafruit_feather_m0_express.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m0_express.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m0_express.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m0_express.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m0_express.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

