joshuawboone/barkitup/zettalights/bootloader/Arduino IDE/boards.txt
# Menu: USB Stack
adafruit_itsybitsy_m4.menu.usbstack.arduino=Arduino
adafruit_itsybitsy_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_itsybitsy_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_itsybitsy_m4.menu.debug.off=Off
adafruit_itsybitsy_m4.menu.debug.on=On
adafruit_itsybitsy_m4.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Feather M4 Express (SAMD51)
# -----------------------------------
adafruit_feather_m4.name=Adafruit Feather M4 Express (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_feather_m4.vid.0=0x239A
adafruit_feather_m4.pid.0=0x8022
adafruit_feather_m4.vid.1=0x239A
adafruit_feather_m4.pid.1=0x0022
adafruit_feather_m4.vid.2=0x239A
adafruit_feather_m4.pid.2=0x8026

# Upload
adafruit_feather_m4.upload.tool=bossac18
adafruit_feather_m4.upload.protocol=sam-ba
adafruit_feather_m4.upload.maximum_size=507904
adafruit_feather_m4.upload.offset=0x4000
adafruit_feather_m4.upload.use_1200bps_touch=true
adafruit_feather_m4.upload.wait_for_upload_port=true
adafruit_feather_m4.upload.native_usb=true

# Build
adafruit_feather_m4.build.mcu=cortex-m4
adafruit_feather_m4.build.f_cpu=120000000L
adafruit_feather_m4.build.usb_product="Feather M4 Express"
adafruit_feather_m4.build.usb_manufacturer="Adafruit"
adafruit_feather_m4.build.board=FEATHER_M4
adafruit_feather_m4.build.core=arduino
adafruit_feather_m4.build.extra_flags=-D__SAMD51J19A__ -DADAFRUIT_FEATHER_M4_EXPRESS -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_feather_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m4.build.openocdscript=scripts/openocd/daplink_samd51.cfg
adafruit_feather_m4.build.variant=feather_m4
adafruit_feather_m4.build.variant_system_lib=
adafruit_feather_m4.build.vid=0x239A
adafruit_feather_m4.build.pid=0x8022
adafruit_feather_m4.bootloader.tool=openocd
adafruit_feather_m4.bootloader.file=featherM4/bootloader-feather_m4-v2.0.0-adafruit.5.bin
adafruit_feather_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adafruit_feather_m4.menu.cache.on=Enabled
adafruit_feather_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_feather_m4.menu.cache.off=Disabled
adafruit_feather_m4.menu.cache.off.build.cache_flags=

# Menu: Speed
adafruit_feather_m4.menu.speed.120=120 MHz (standard)
adafruit_feather_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_feather_m4.menu.speed.150=150 MHz (overclock)
adafruit_feather_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_feather_m4.menu.speed.180=180 MHz (overclock)
adafruit_feather_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_feather_m4.menu.speed.200=200 MHz (overclock)
adafruit_feather_m4.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adafruit_feather_m4.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m4.menu.opt.fast=Fast (-O2)
adafruit_feather_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m4.menu.opt.faster=Faster (-O3)
adafruit_feather_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adafruit_feather_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_feather_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_feather_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_feather_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

# Menu: USB Stack
adafruit_feather_m4.menu.usbstack.arduino=Arduino
adafruit_feather_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_feather_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_feather_m4.menu.debug.off=Off
adafruit_feather_m4.menu.debug.on=On
adafruit_feather_m4.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Feather M4 CAN (SAME51)
# -----------------------------------
adafruit_feather_m4_can.name=Adafruit Feather M4 CAN (SAME51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_feather_m4_can.vid.0=0x239A
adafruit_feather_m4_can.pid.0=0x80CD
adafruit_feather_m4_can.vid.1=0x239A
adafruit_feather_m4_can.pid.1=0x00CD

# Upload
adafruit_feather_m4_can.upload.tool=bossac18
adafruit_feather_m4_can.upload.protocol=sam-ba
adafruit_feather_m4_can.upload.maximum_size=507904
adafruit_feather_m4_can.upload.offset=0x4000
adafruit_feather_m4_can.upload.use_1200bps_touch=true
adafruit_feather_m4_can.upload.wait_for_upload_port=true
adafruit_feather_m4_can.upload.native_usb=true

# Build
adafruit_feather_m4_can.build.mcu=cortex-m4
adafruit_feather_m4_can.build.f_cpu=120000000L
adafruit_feather_m4_can.build.usb_product="Feather M4 CAN"
adafruit_feather_m4_can.build.usb_manufacturer="Adafruit"
adafruit_feather_m4_can.build.board=FEATHER_M4_CAN
adafruit_feather_m4_can.build.core=arduino
adafruit_feather_m4_can.build.extra_flags=-D__SAME51J19A__ -DADAFRUIT_FEATHER_M4_EXPRESS -DADAFRUIT_FEATHER_M4_CAN -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_feather_m4_can.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m4_can.build.openocdscript=scripts/openocd/daplink_samd51.cfg
adafruit_feather_m4_can.build.variant=feather_m4_can
adafruit_feather_m4_can.build.variant_system_lib=
adafruit_feather_m4_can.build.vid=0x239A
adafruit_feather_m4_can.build.pid=0x80CD
adafruit_feather_m4_can.bootloader.tool=openocd
adafruit_feather_m4_can.bootloader.file=featherM4/bootloader-feather_m4_express-v2.0.0-adafruit.5.bin
adafruit_feather_m4_can.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adafruit_feather_m4_can.menu.cache.on=Enabled
adafruit_feather_m4_can.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_feather_m4_can.menu.cache.off=Disabled
adafruit_feather_m4_can.menu.cache.off.build.cache_flags=

# Menu: Speed
adafruit_feather_m4_can.menu.speed.120=120 MHz (standard)
adafruit_feather_m4_can.menu.speed.120.build.f_cpu=120000000L
adafruit_feather_m4_can.menu.speed.150=150 MHz (overclock)
adafruit_feather_m4_can.menu.speed.150.build.f_cpu=150000000L
adafruit_feather_m4_can.menu.speed.180=180 MHz (overclock)
adafruit_feather_m4_can.menu.speed.180.build.f_cpu=180000000L
adafruit_feather_m4_can.menu.speed.200=200 MHz (overclock)
adafruit_feather_m4_can.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adafruit_feather_m4_can.menu.opt.small=Small (-Os) (standard)
adafruit_feather_m4_can.menu.opt.small.build.flags.optimize=-Os
adafruit_feather_m4_can.menu.opt.fast=Fast (-O2)
adafruit_feather_m4_can.menu.opt.fast.build.flags.optimize=-O2
adafruit_feather_m4_can.menu.opt.faster=Faster (-O3)
adafruit_feather_m4_can.menu.opt.faster.build.flags.optimize=-O3
adafruit_feather_m4_can.menu.opt.fastest=Fastest (-Ofast)
adafruit_feather_m4_can.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_feather_m4_can.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_feather_m4_can.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adafruit_feather_m4_can.menu.maxqspi.50=50 MHz (standard)
adafruit_feather_m4_can.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_feather_m4_can.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_feather_m4_can.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

