joshuawboone/barkitup/zettalights/bootloader/Arduino IDE/boards.txt
# Menu: USB Stack
adafruit_hallowing_m4.menu.usbstack.arduino=Arduino
adafruit_hallowing_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_hallowing_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_hallowing_m4.menu.debug.off=Off
adafruit_hallowing_m4.menu.debug.on=On
adafruit_hallowing_m4.menu.debug.on.build.flags.debug=-g


# -----------------------------------
# Adafruit Matrix Portal M4 (SAMD51)
# -----------------------------------
adafruit_matrixportal_m4.name=Adafruit Matrix Portal M4 (SAMD51)

# VID/PID for Bootloader, Arduino & CircuitPython
adafruit_matrixportal_m4.vid.0=0x239A
adafruit_matrixportal_m4.pid.0=0x80C9
adafruit_matrixportal_m4.vid.1=0x239A
adafruit_matrixportal_m4.pid.1=0x00C9
adafruit_matrixportal_m4.vid.2=0x239A
adafruit_matrixportal_m4.pid.2=0x80CA

# Upload
adafruit_matrixportal_m4.upload.tool=bossac18
adafruit_matrixportal_m4.upload.protocol=sam-ba
adafruit_matrixportal_m4.upload.maximum_size=507904
adafruit_matrixportal_m4.upload.offset=0x4000
adafruit_matrixportal_m4.upload.use_1200bps_touch=true
adafruit_matrixportal_m4.upload.wait_for_upload_port=true
adafruit_matrixportal_m4.upload.native_usb=true

# Build
adafruit_matrixportal_m4.build.mcu=cortex-m4
adafruit_matrixportal_m4.build.f_cpu=120000000L
adafruit_matrixportal_m4.build.usb_product="Matrix Portal M4"
adafruit_matrixportal_m4.build.usb_manufacturer="Adafruit"
adafruit_matrixportal_m4.build.board=MATRIXPORTAL_M4
adafruit_matrixportal_m4.build.core=arduino
adafruit_matrixportal_m4.build.extra_flags=-D__SAMD51J19A__ -DCRYSTALLESS  -DADAFRUIT_MATRIXPORTAL_M4_EXPRESS -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
adafruit_matrixportal_m4.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_matrixportal_m4.build.openocdscript=scripts/openocd/daplink_samd51.cfg
adafruit_matrixportal_m4.build.variant=matrixportal_m4
adafruit_matrixportal_m4.build.variant_system_lib=
adafruit_matrixportal_m4.build.vid=0x239A
adafruit_matrixportal_m4.build.pid=0x80C9
adafruit_matrixportal_m4.bootloader.tool=openocd
adafruit_matrixportal_m4.bootloader.file=matrixportalM4/bootloader-matrixportal_m4.bin
adafruit_matrixportal_m4.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu: Cache
adafruit_matrixportal_m4.menu.cache.on=Enabled
adafruit_matrixportal_m4.menu.cache.on.build.cache_flags=-DENABLE_CACHE
adafruit_matrixportal_m4.menu.cache.off=Disabled
adafruit_matrixportal_m4.menu.cache.off.build.cache_flags=

# Menu: Speed
adafruit_matrixportal_m4.menu.speed.120=120 MHz (standard)
adafruit_matrixportal_m4.menu.speed.120.build.f_cpu=120000000L
adafruit_matrixportal_m4.menu.speed.150=150 MHz (overclock)
adafruit_matrixportal_m4.menu.speed.150.build.f_cpu=150000000L
adafruit_matrixportal_m4.menu.speed.180=180 MHz (overclock)
adafruit_matrixportal_m4.menu.speed.180.build.f_cpu=180000000L
adafruit_matrixportal_m4.menu.speed.200=200 MHz (overclock)
adafruit_matrixportal_m4.menu.speed.200.build.f_cpu=200000000L

# Menu: Optimization
adafruit_matrixportal_m4.menu.opt.small=Small (-Os) (standard)
adafruit_matrixportal_m4.menu.opt.small.build.flags.optimize=-Os
adafruit_matrixportal_m4.menu.opt.fast=Fast (-O2)
adafruit_matrixportal_m4.menu.opt.fast.build.flags.optimize=-O2
adafruit_matrixportal_m4.menu.opt.faster=Faster (-O3)
adafruit_matrixportal_m4.menu.opt.faster.build.flags.optimize=-O3
adafruit_matrixportal_m4.menu.opt.fastest=Fastest (-Ofast)
adafruit_matrixportal_m4.menu.opt.fastest.build.flags.optimize=-Ofast
adafruit_matrixportal_m4.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
adafruit_matrixportal_m4.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: QSPI Speed
adafruit_matrixportal_m4.menu.maxqspi.50=50 MHz (standard)
adafruit_matrixportal_m4.menu.maxqspi.50.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
adafruit_matrixportal_m4.menu.maxqspi.fcpu=CPU Speed / 2
adafruit_matrixportal_m4.menu.maxqspi.fcpu.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})

# Menu: USB Stack
adafruit_matrixportal_m4.menu.usbstack.arduino=Arduino
adafruit_matrixportal_m4.menu.usbstack.tinyusb=TinyUSB
adafruit_matrixportal_m4.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
adafruit_matrixportal_m4.menu.debug.off=Off
adafruit_matrixportal_m4.menu.debug.on=On
adafruit_matrixportal_m4.menu.debug.on.build.flags.debug=-g


# Rabid Prototypes Tau (Native USB Port)
# ---------------------------------------
tau.name=Rabid Prototypes Tau (Native USB Port)
tau.vid.0=0x2341
tau.pid.0=0x004d

tau.upload.tool=rabid prototypes:bossac
tau.upload.protocol=sam-ba
tau.upload.maximum_size=131072
tau.upload.use_1200bps_touch=true
tau.upload.wait_for_upload_port=true
tau.upload.native_usb=true
tau.build.mcu=cortex-m0plus
tau.build.f_cpu=48000000L
tau.build.usb_product="Tau"
tau.build.usb_manufacturer="Rabid Prototypes"
tau.build.board=SAMD_TAU
tau.build.core=arduino
tau.build.extra_flags=-D__SAMD21E17A__ -DCRYSTALLESS -DARM_MATH_CM0PLUS {build.usb_flags}
tau.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
tau.build.openocdscript=openocd_scripts/arduino_zero.cfg
tau.build.variant=tau
tau.build.variant_system_lib=
tau.build.vid=0x2341
tau.build.pid=0x004d
tau.bootloader.tool=openocd
tau.bootloader.file=tau/samd21_sam_ba.bin


# -----------------------------------
# ZL Custom E17A
# -----------------------------------
zl_custom.name=ZL Custom E17A
 
# VID/PID for Bootloader, Arduino & CircuitPython
zl_custom.vid.0=0x239A
zl_custom.pid.0=0x801E
zl_custom.vid.1=0x239A
zl_custom.pid.1=0x001E
 
# Upload
zl_custom.upload.tool=bossac18
#zl_custom.upload.tool=rabid prototypes:bossac
zl_custom.upload.protocol=sam-ba
zl_custom.upload.maximum_size=131072
zl_custom.upload.offset=0x2000
zl_custom.upload.use_1200bps_touch=true
zl_custom.upload.wait_for_upload_port=true
zl_custom.upload.native_usb=true
 
# Build
zl_custom.build.mcu=cortex-m0plus
zl_custom.build.f_cpu=48000000L
zl_custom.build.usb_product="Gemma M0"
zl_custom.build.usb_manufacturer="Adafruit"
zl_custom.build.board=GEMMA_M0
zl_custom.build.core=arduino
zl_custom.build.extra_flags=-D__SAMD21E17A__ -DCRYSTALLESS -DADAFRUIT_GEMMA_M0 -DARM_MATH_CM0PLUS {build.usb_flags}
zl_custom.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
zl_custom.build.openocdscript=scripts/openocd/daplink_samd21.cfg
zl_custom.build.variant=zlcustom
zl_custom.build.variant_system_lib=
zl_custom.build.vid=0x239A
zl_custom.build.pid=0x801E
zl_custom.bootloader.tool=openocd
zl_custom.bootloader.file=zlcustom/bootloader-zlcustom.bin
 
# Menu: Optimization
zl_custom.menu.opt.small=Small (-Os) (standard)
zl_custom.menu.opt.small.build.flags.optimize=-Os
zl_custom.menu.opt.fast=Fast (-O2)
zl_custom.menu.opt.fast.build.flags.optimize=-O2
zl_custom.menu.opt.faster=Faster (-O3)
zl_custom.menu.opt.faster.build.flags.optimize=-O3
zl_custom.menu.opt.fastest=Fastest (-Ofast)
zl_custom.menu.opt.fastest.build.flags.optimize=-Ofast
zl_custom.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
zl_custom.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops
 
# Menu: USB Stack
zl_custom.menu.usbstack.arduino=Arduino
zl_custom.menu.usbstack.tinyusb=TinyUSB
zl_custom.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
